const musicIdList = [
  "不走寻常路",
  "纽约地铁", 
  "七里香",
  "以父之名",
  "忍者",
  "夜的第七章",
  "最后的战役",
  "稻香",
  "退后",
  "晴天",
  "说好的幸福呢",
  "兰亭序",
  "说了再见",
  "反方向的钟",
  "轨迹",
  "花海",
  "半岛铁盒",
  "蒲公英的约定",
  "最长的电影",
  "甜甜的",
  "爱在西元前",
  "枫",
  "烟花易冷",
  "一路向北",
  "我落泪情绪零碎",
  "不能说的秘密",
  "搁浅",
  "夜曲",
  "发如雪",
  "蜗牛",
  "龙卷风",
  "爱情悬崖",
  "安静",
  "青花瓷",
  "外婆",
  "断了的弦",
  "借口",
  "本草纲目",
  "上海一九四三",
  "逆鳞",
  "同一种调调",
  "白色风车",
  "龙拳",
  "威廉古堡",
  "一口气全念对",
  "困兽之斗",
  "迷魂曲",
  "完美主义",
  "无双",
  "公公偏头痛",
  "免费教学录影带",
  "魔术先生",
  "床边故事",
  "霍元甲",
  "半兽人",
  "斗牛",
  "皮影戏",
  "瓦解",
  "东风破",
  "我的地盘",
  "可爱女人",
  "开不了口",
  "超跑女神",
  "手写的从前",
  "暗号",
  "千里之外",
  "雨下一整晚",
  "听妈妈的话",
  "娘子",
  "周大侠",
  "星晴",
  "印第安老斑鸠",
  "黑色幽默",
  "可爱女人",
  "我的地盘",
  "心雨",
  "黄金甲",
  "她的睫毛",
  "园游会",
  "前世情人",
  "乱舞春秋",
  "爷爷泡的茶",
  "龙战骑士",
  "琴伤",
  "懦夫",
  "四面楚歌",
  "给我一首歌的时间",
  "梯田",
  "火车叨位去",
  "三年二班",
  "飘移",
  "浪漫手机",
  "红模仿",
  "阳光宅男",
  "伊斯坦堡",
  "世界未末日",
  "将军",
  "分裂",
  "双刀",
  "麦芽糖",
  "蓝色风暴",
  "跨时代",
  "止战之殇",
  "迷迭香",
  "牛仔很忙",
  "乔克叔叔",
  "扯",
  "双截棍",
]

const one_lrc = "[ti:不走寻常路]\n[ar:周杰伦]\n[al:不走寻常路]\n[by:]\n[offset:0]\n[00:00:00] 不走寻常路 - 周杰伦\n[00:03:00] 词：周杰伦\n[00:06:00] 曲：周杰伦\n[00:41.00]我向前一步 不走寻常路\n[00:43.05]这意大利面你就要走出一条新思路\n[00:45.31]看我黄皮肤 秀篮球工夫\n[00:47.23]在另旁隔壁你敢不敢来挑战艺术\n[00:49.78]我向前一步(向前一步)\n[00:52.01]不走寻常路 (不走寻常路)\n[00:54.72]我向前一步(向前一步)\n[00:56.96]不走寻常路 (不走寻常路)\n[01:08.84]我向前一步(向前一步)\n[01:10.55]不走寻常路 (不走寻常路)\n[01:12.79]我向前一步(向前一步)\n[01:15.07]不走寻常路 (不走寻常路)\n[01:35.48]我向前一步 不走寻常路\n[01:37.25]这意大利面你就要走出一条新思路\n[01:39.98]看我黄皮肤 秀篮球工夫\n[01:41.71]在另旁隔壁你敢不敢来挑战艺术\n[01:44.18]我向前一步(向前一步)\n[01:46.33]不走寻常路 (不走寻常路)\n[01:49.12]我向前一步(向前一步)\n[01:51.48]不走寻常路 (不走寻常路)\n[02:11.76]我向前一步(向前一步)\n[02:13.92]不走寻常路 (不走寻常路)\n[02:16.22]我向前一步(向前一步)\n[02:18.58]不走寻常路 (不走寻常路)\n[02:21.04]我向前一步(向前一步)\n[02:23.33]不走寻常路 (不走寻常路)\n[02:25.65]我向前一步(向前一步)\n[02:27.93]不走寻常路 (不走寻常路)\n[02:30.27]我向前一步(向前一步)\n[02:32.51]不走寻常路 (不走寻常路)\n[02:34.77]我向前一步(向前一步)\n[02:36.81]不走寻常路 (不走寻常路)\n"

const second_lrc = 
  "[ti:纽约地铁]\n" +
  "[ar:周杰伦]\n" +
  "[al:纽约地铁]\n" +
  "[by:]\n" +
  "[offset:0]\n" +
  "[00:00:00] 纽约地铁 - 周杰伦\n" +
  "[00:02:00] 词：黄俊郎\n" +
  "[00:05:00] 曲：周杰伦\n" +
  "[00:24:00] 曼哈顿的夕阳\n" +
  "[00:25:00] 投射出尊严的黄色小调\n" +
  "[00:27:00] 对照黯淡\n" +
  "[00:28:00] 地下道那卑微的咆哮\n" +
  "[00:29:00] 名利在炫耀\n" +
  "[00:30:00] 在酒池燃烧\n" +
  "[00:31:00] 我想要忘掉\n" +
  "[00:32:00] 我会改变\n" +
  "[00:33:00] 我会祷告\n" +
  "[00:34:00] 我会变得重要\n" +
  "[00:35:00] 咬着牙齿 坚持穿过\n" +
  "[00:37:00] 布鲁克林的转角\n" +
  "[00:38:00] 我想洗掉回忆里\n" +
  "[00:40:00] 那一阵一阵的嘲笑\n" +
  "[00:41:00] 生存只有一种立场\n" +
  "[00:43:00] 一块以我命名的土壤\n" +
  "[00:45:00] 跟一扇有阳光的窗\n" +
  "[00:46:00] 我的打拼 是用生命\n" +
  "[00:48:00] 肩膀的痛\n" +
  "[00:49:00] 有时梦到 被人开枪\n" +
  "[00:51:00] 醒来还是害怕\n" +
  "[00:52:00] 你可知道 我哭的时候\n" +
  "[00:54:00] 绝对不出声\n" +
  "[00:55:00] 笑的时候 我会故意\n" +
  "[00:56:00] 越来越大声\n" +
  "[00:57:00] 我的故乡 到底在哪\n" +
  "[00:59:00] 你可知道 在我的双脚\n" +
  "[01:01:00] 只能可以这样一直走\n" +
  "[01:03:00] 为了一块饼 一台车\n" +
  "[01:05:00] 一个避雨的屋檐\n" +
  "[01:06:00] 要是倒下去的时候\n" +
  "[01:07:00] 想要倒在这\n" +
  "[01:08:00] 我们的天真 只能后退\n" +
  "[01:11:00] 生存的街 没有无邪\n" +
  "[01:14:00] 每个深夜都该学会\n" +
  "[01:17:00] 用冷笑包围 痛的懊悔\n" +
  "[01:19:00] 站在纽约的地下铁\n" +
  "[01:22:00] 我的寂寞 更加深邃\n" +
  "[01:25:00] 这个世界 想要活着\n" +
  "[01:28:00] 就不要有感觉\n" +
  "[01:33:00] 异乡陌生的香 刺眼的光\n" +
  "[01:36:00] 小小的床 白色的墙\n" +
  "[01:38:00] 十字的长廊 排斥的目光\n" +
  "[01:40:00] 浪潮般的沮丧失望\n" +
  "[01:42:00] 我爬的方向 应该向着阳光\n" +
  "[01:44:00] 让背后的伤赶不上\n" +
  "[01:46:00] 不会被挫折埋葬 我要更强\n" +
  "[01:48:00] 我会超出你想象\n" +
  "[01:50:00] 我不想成为像\n" +
  "[01:51:00] 诗人书里的一句感伤\n" +
  "[01:53:00] 我不是好莱坞\n" +
  "[01:54:00] 电影里面的过场\n" +
  "[01:55:00] 我的打拼 是用生命\n" +
  "[01:57:00] 肩膀的痛\n" +
  "[01:58:00] 有时梦到 被人开枪\n" +
  "[02:00:00] 醒来还是害怕\n" +
  "[02:01:00] 你可知道 我哭的时候\n" +
  "[02:03:00] 绝对不出声\n" +
  "[02:04:00] 笑的时候 我会故意\n" +
  "[02:05:00] 越来越大声\n" +
  "[02:06:00] 我的故乡 到底在哪\n" +
  "[02:08:00] 你可知道 在我的双脚\n" +
  "[02:10:00] 只能可以这样一直走\n" +
  "[02:12:00] 为了一块饼 一台车\n" +
  "[02:13:00] 一个避雨的屋檐\n" +
  "[02:15:00] 要是倒下去的时候\n" +
  "[02:16:00] 想要倒在这\n" +
  "[02:17:00] 我们的天真 只能后退\n" +
  "[02:20:00] 生存的街 没有无邪\n" +
  "[02:23:00] 每个深夜都该学会\n" +
  "[02:26:00] 用冷笑包围 痛的懊悔\n" +
  "[02:28:00] 站在纽约的地下铁\n" +
  "[02:31:00] 我的寂寞 更加深邃\n" +
  "[02:34:00] 这个世界 想要活着\n" +
  "[02:37:00] 就不要有感觉\n" +
  "[02:39:00] 我们的天真 只能后退\n" +
  "[02:42:00] 生存的街 没有无邪\n" +
  "[02:45:00] 每个深夜都该学会\n" +
  "[02:48:00] 用冷笑包围 痛的懊悔\n" +
  "[02:50:00] 站在纽约的地下铁\n" +
  "[02:53:00] 我的寂寞 更加深邃\n" +
  "[02:56:00] 这个世界 想要活着\n" +
  "[02:59:00] 就不要有感觉\n";

const locale = {
  nick: '昵称',
  nickError: '昵称不能少于3个字符',
  mail: '邮箱',
  mailError: '请填写正确的邮件地址',
  link: '网址',
  optional: '可选',
  placeholder: '欢迎评论',
  sofa: '来发评论吧~',
  submit: '发布',
  like: '喜欢',
  cancelLike: '取消喜欢',
  reply: '回复',
  cancelReply: '取消回复',
  comment: '评论',
  refresh: '刷新',
  more: '加载更多...',
  preview: '预览',
  emoji: '表情',
  uploadImage: '上传图片',
  seconds: '秒前',
  minutes: '分钟前',
  hours: '小时前',
  days: '天前',
  now: '刚刚',
  uploading: '正在上传',
  login: '登录',
  logout: '退出',
  admin: '博主',
  sticky: '置顶',
  word: '字',
  wordHint: '评论字数应在 $0 到 $1 字之间！\n当前字数：$2',
  anonymous: '匿名',
  level0: '潜水',
  level1: '冒泡',
  level2: '吐槽',
  level3: '活跃',
  level4: '话痨',
  level5: '',
  gif: '表情包',
  gifSearchPlaceholder: '搜索表情包',
  profile: '个人资料',
  approved: '通过',
  waiting: '待审核',
  spam: '垃圾',
  unsticky: '取消置顶',
  oldest: '按倒序',
  latest: '按正序',
  hottest: '按热度',
  reactionTitle: '你认为这个网站怎么样？留下你的评论吧~',
};

const cardDescList = [
  '基于标准HTML、CSS和JavaScript构建，并提供了一套声明式的、组件化的编程模型。',
  '用于构建用户界面的JS库，特点是声明式编码、JSX 语法、和 React Native 编写原生应用等。',
  'Autodesk公司出品的世界顶级的三维动画软件，应用对象是专业的影视广告，角色动画，电影特技等。',
  '一种具有函数优先的轻量级，解释型或即时编译型的编程语言。'
]